print("\033[4m" + "Задание 1" + "\033[0m", "\n")

age = input("Введите ваш возраст: ")
age = int(age)
future_age =age + 5
print("Через 5 лет вам будет", future_age, "лет.", "\n")

print("\033[4m" + "Задание 2" + "\033[0m","\n")
a = "Ваш возраст:" #string
b = 25 #integer
c = True #boolean
print(a + " " +str(b) + ". Это правда? " + str(c), "\n")

print("\033[4m" + "Задание 3" + "\033[0m","\n")
num1 = int(input("Введите первое число: "))
num2 = int(input("Введите второе число: "))
print("Остаток от деления", num1, "на", num2, "равен:", num1 % num2,"\n")

print("\033[4m" + "Задание 4" + "\033[0m","\n")
a = int(input("Введите число a: "))
b = int(input("Введите число b: "))
c = int(input("Введите число c: "))
print("Результат выражения (a + b) * c:", (a + b) * c)
print("Результат выражения (a * b) + c:", (a * b) + c, "\n")

print("\033[4m" + "Задание 5" + "\033[0m","\n")
a = int(input("Введите первое число: "))
b = int(input("Введите первое число: "))
numbers = [a, b]
print("До обмена: первое число =", numbers[0], ", второе число =", numbers[1])
print("После обмена: первое число =", numbers[-1], ", второе число =", numbers[-2])